### Import

In [1]:
import pandas as pd 
import numpy as np 

print(pd.__version__)
print(np.__version__)

1.3.4
1.20.3

### Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),
                 columns=cols)
df

    A   B   C   D   E
0  13   2   1   6  16
1  19  16  19  18  14
2   9  17  11   5   8
3  18   5  14   7  16
4   4   4  19  15  17
5   8   3   5  15   5
6  12   6  19  12   9
7   5  19  12   9   7
8  13  12   3   6  16
9   3   8   7  13   5

### Membagi Data Frame menjadi dua secara acak berdasarkan proporsi tertentu

In [4]:
df.shape

(10, 5)

In [8]:
### df.sample ini akan mengambil baris secara acak sejumlah 70% dr baris-baris dataframe df.

In [5]:
proporsi = 0.7
df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f'df_1 shape: {df_1.shape}')
print(f'df_2 shape: {df_2.shape}')

df_1 shape: (7, 5)
df_2 shape: (3, 5)

In [6]:
df_1

    A   B   C   D   E
6  12   6  19  12   9
4   4   4  19  15  17
1  19  16  19  18  14
0  13   2   1   6  16
7   5  19  12   9   7
5   8   3   5  15   5
3  18   5  14   7  16

In [7]:
df_2

    A   B   C   D   E
2   9  17  11   5   8
8  13  12   3   6  16
9   3   8   7  13   5